In [1]:
import pandas as pd

In [2]:
movies = pd.read_csv("/data/movielens/movies.csv")
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [7]:
movies[movies.title.str.contains("Godfather")]

      movieId                            title                        genres
695       858            Godfather, The (1972)                   Crime|Drama
977      1221   Godfather: Part II, The (1974)                   Crime|Drama
1585     2023  Godfather: Part III, The (1990)  Crime|Drama|Mystery|Thriller
5470     8607          Tokyo Godfathers (2003)     Adventure|Animation|Drama

In [3]:
movies[movies.title == "Godfather, The (1972)"]

     movieId                  title       genres
695      858  Godfather, The (1972)  Crime|Drama

In [6]:
d = movies[movies.title == "Godfather, The (1972)"].movieId
d

695    858
Name: movieId, dtype: int64

In [8]:
list(d)

[858]

In [9]:
list(d)[0]

858

In [11]:
d.to_list()[0]

858

In [13]:
d.values[0]

858

In [14]:
ratings = pd.read_csv("/data/movielens/ratings.csv")

In [15]:
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [19]:
ratings[ratings.movieId == 858].shape

(200, 4)

In [26]:
ratings.query("movieId == 858").head()

      userId  movieId  rating   timestamp
180        4      858     5.0   949779022
370        5      858     2.5  1163373651
602        8      858     5.0  1154400181
1140      15      858     5.0   997938703
2730      17      858     5.0  1127469000

In [27]:
agg = ratings.groupby("movieId")\
.rating.agg(["mean", "count"]).query("count>100")

agg

             mean  count
movieId
1        3.872470    247
2        3.401869    107
6        3.884615    104
10       3.450820    122
25       3.742574    101
32       3.923469    196
34       3.601351    148
36       3.937500    104
39       3.550000    120
47       4.034826    201
50       4.370647    201
110      3.945175    228
111      4.224576    118
150      3.902500    200
153      2.782946    129
165      3.443662    142
185      3.102941    102
208      2.752212    113
223      3.963303    109
231      3.110759    158
253      3.396000    125
260      4.221649    291
288      3.336449    107
292      3.309091    110
293      4.071970    132
296      4.256173    324
316      3.368966    145
318      4.487138    311
329      3.350877    114
339      3.440594    101
...           ...    ...
2918     4.007519    133
2959     4.178218    202
2987     3.666667    108
2997     3.956349    126
3114     3.844000    125
3147     3.922330    103
3578     3.965839    161
3793     3.559055    127
3996     3.855263    114
4226     4.227273    132
4306     3.847701    174
4886     3.884615    130
4896     3.657143    105
4963     3.880769    130
4973     4.096000    125
4993     4.182500    200
4995     3.951754    114
5349     3.522388    134
5445     3.686957    115
5952     4.061170    188
6377     3.803279    122
6539     3.854610    141
6874     3.819820    111
7153     4.127841    176
7361     4.122642    106
7438     3.665049    103
8961     3.861111    126
33794    3.857143    105
58559    4.235537    121
79132    4.049550    111

[149 rows x 2 columns]

In [29]:
agg.loc[[858]]

           mean  count
movieId
858      4.4875    200

In [31]:
agg.reset_index().query("movieId == 858")

    movieId    mean  count
62      858  4.4875    200

In [36]:
top10_movie_id = agg.sort_values("mean", ascending=False).iloc[:10, :]
top10_movie_id

             mean  count
movieId
858      4.487500    200
318      4.487138    311
1221     4.385185    135
50       4.370647    201
527      4.303279    244
1193     4.256944    144
608      4.256696    224
296      4.256173    324
2858     4.236364    220
58559    4.235537    121

In [37]:
top10_movie_id.merge(movies, on = "movieId")

,movieId,mean,count,title,genres
0,858,4.487500,200,"Godfather, The (1972)",Crime|Drama
1,318,4.487138,311,"Shawshank Redemption, The (1994)",Crime|Drama
2,1221,4.385185,135,"Godfather: Part II, The (1974)",Crime|Drama
3,50,4.370647,201,"Usual Suspects, The (1995)",Crime|Mystery|Thriller
4,527,4.303279,244,Schindler's List (1993),Drama|War
5,1193,4.256944,144,One Flew Over the Cuckoo's Nest (1975),Drama
6,608,4.256696,224,Fargo (1996),Comedy|Crime|Drama|Thriller
7,296,4.256173,324,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
8,2858,4.236364,220,American Beauty (1999),Drama|Romance
9,58559,4.235537,121,"Dark Knight, The (2008)",Action|Crime|Drama|IMAX